public/man/man1/fuse2fs.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - fuse2fs.1 | Technical Notes</title>

    <link rel="stylesheet" href="/css/main.css">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - fuse2fs.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>fuse2fs - FUSE file system client for ext2/ext3/ext4 file systems</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p><strong>fuse2fs</strong> [ <strong>device/image</strong> ] [ <strong>mountpoint</strong> ] [ <em>options</em> ]</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
DESCRIPTION
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p><strong>fuse2fs</strong> is a FUSE file system client that supports reading and writing
from devices or image files containing ext2, ext3, and ext4 file
systems.</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
OPTIONS
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<div id="outline-container-headline-5" class="outline-3">
<h3 id="headline-5">
general options:
</h3>
<div id="outline-text-headline-5" class="outline-text-3">
<dl>
<dt>
<strong>-o</strong> opt,[opt…]
</dt>
<dd>mount options</dd>
<dt>
<strong>-h</strong> <strong>–help</strong>
</dt>
<dd>print help</dd>
<dt>
<strong>-V</strong> <strong>–version</strong>
</dt>
<dd>print version</dd>
</dl>
</div>
</div>
<div id="outline-container-headline-6" class="outline-3">
<h3 id="headline-6">
fuse2fs options:
</h3>
<div id="outline-text-headline-6" class="outline-text-3">
<dl>
<dt>
<strong>-o</strong> ro
</dt>
<dd>read-only mount</dd>
<dt>
<strong>-o</strong> errors=panic
</dt>
<dd>dump core on error</dd>
<dt>
<strong>-o</strong> minixdf
</dt>
<dd>minix-style df</dd>
<dt>
<strong>-o</strong> fakeroot
</dt>
<dd>pretend to be root for permission checks</dd>
<dt>
<strong>-o</strong> no_default_opts
</dt>
<dd>do not include default fuse options</dd>
<dt>
<strong>-o</strong> norecovery
</dt>
<dd>do not replay the journal and mount the file system
read-only</dd>
<dt>
<strong>-o</strong> fuse2fs_debug
</dt>
<dd>enable fuse2fs debugging</dd>
</dl>
</div>
</div>
<div id="outline-container-headline-7" class="outline-3">
<h3 id="headline-7">
FUSE options:
</h3>
<div id="outline-text-headline-7" class="outline-text-3">
<dl>
<dt>
<strong>-d -o</strong> debug
</dt>
<dd>enable debug output (implies -f)</dd>
<dt>
<strong>-f</strong>
</dt>
<dd>foreground operation</dd>
<dt>
<strong>-s</strong>
</dt>
<dd>disable multi-threaded operation</dd>
</dl>
<p>For other FUSE options please see *mount.fuse*(8) or see the output of
<em>fuse2fs –helpfull</em></p>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-8" class="outline-2">
<h2 id="headline-8">
AVAILABILITY
</h2>
<div id="outline-text-headline-8" class="outline-text-2">
<p><strong>fuse2fs</strong> is part of the e2fsprogs package and is available from
<a href="http://e2fsprogs.sourceforge.net.">http://e2fsprogs.sourceforge.net.</a></p>
</div>
</div>
<div id="outline-container-headline-9" class="outline-2">
<h2 id="headline-9">
SEE ALSO
</h2>
<div id="outline-text-headline-9" class="outline-text-2">
<p>*ext4*(5) *e2fsck*(8), *mount.fuse*(8)</p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.js"></script>
    </body>
</html>
